{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: resetting speech recognition state after saving notes and clearing transcript state to prevent duplicate content, both with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their functionality, including the main App component, speech recognition hook, storage utilities, and UI components.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, including color tokens for UI components and design system values.",
  "frontend/index.html": "Minimal HTML entry point with root div and module script reference to main.tsx for the React application.",
  "frontend/QA-CHECKLIST.md": "Comprehensive manual QA testing checklist covering speech recognition, notes management, deletion flows, edge cases, and expected results for each test scenario.",
  "frontend/README.md": "Documentation explaining that this is a web app (not desktop), detailing browser requirements for Web Speech API, usage instructions, and technical details about localStorage-based note storage.",
  "frontend/src/App.tsx": "Main React component managing speech recognition state, note creation/deletion, modal visibility, and automatic restart of recording after saving notes with proper transcript clearing.",
  "frontend/src/components/DeleteAllConfirmDialog.tsx": "Modal confirmation dialog component for the destructive delete-all-notes action with cancel and confirm buttons.",
  "frontend/src/components/InlineNotice.tsx": "Simple notification component displaying success or error messages with variant-based styling.",
  "frontend/src/components/NotesModal.tsx": "Modal component displaying a list of saved notes with inline editing capability, individual delete confirmations, formatted timestamps, and edit/save/cancel actions.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages an authenticated or anonymous actor instance for backend communication, using Internet Identity for authentication and React Query for caching. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for managing user login/logout state with AuthClient. Handles identity persistence, delegation validation, and authentication status tracking.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook that wraps the Web Speech Recognition API for continuous French voice transcription. Manages listening state, transcript accumulation (final and interim), error handling, and provides start/stop/clear controls.",
  "frontend/src/index.css": "Global CSS with Tailwind directives, CSS custom properties for theming (light/dark mode), and custom styles for the note-taking app UI including transcription area, action buttons, modal, and footer sections.",
  "frontend/src/lib/notesStorage.ts": "LocalStorage-based notes management library providing CRUD operations (create, list, update, delete) for Note objects with automatic persistence and error handling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context before rendering the App component.",
  "frontend/src/types/notes.ts": "TypeScript interface definition for Note objects with id, content, and created_at timestamp properties.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, border radius variables, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata tracking a known issue where voice recording fails after saving the first note, with feature requests to reset speech recognition state and clear transcripts properly after each save operation."
}