{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend for the Internet Computer canister.",
  "feature_evidence.json": "Feature evidence report mapping four UI requirements (three blue rectangular buttons with icons and French labels) to implementation files App.tsx and index.css with high confidence.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React voice note app with blue rectangular buttons, speech recognition, localStorage persistence, and French UI.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes and base styling for the application.",
  "frontend/index.html": "Minimal HTML entry point with root div and module script reference to main.tsx.",
  "frontend/QA-CHECKLIST.md": "Comprehensive manual QA testing checklist covering speech recognition, notes management, deletion flows, edge cases, and expected results for each test scenario.",
  "frontend/README.md": "Documentation explaining this is a web app (not desktop Tauri), detailing browser requirements for Web Speech API, usage instructions, and technical details about localStorage-based note persistence.",
  "frontend/src/App.tsx": "Main React component implementing three blue rectangular buttons (record with Mic icon, view with FileText icon, delete with Trash2 icon), speech recognition integration, auto-save on stop, note counter, and modal management.",
  "frontend/src/components/DeleteAllConfirmDialog.tsx": "Modal confirmation dialog component for delete-all action with cancel and confirm buttons.",
  "frontend/src/components/InlineNotice.tsx": "Simple notification component displaying success or error messages with variant styling.",
  "frontend/src/components/NotesModal.tsx": "Modal component for displaying, editing, and deleting notes with confirmation dialogs. Uses ScrollArea for the list and integrates with notesStorage functions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an ICP backend actor based on Internet Identity authentication state. Invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication using @dfinity/auth-client. Manages login state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useSpeechRecognition.ts": "Custom hook wrapping Web Speech API for continuous French speech recognition with interim and final transcripts. Handles errors, auto-restart, and browser compatibility.",
  "frontend/src/index.css": "Global styles with CSS custom properties for light/dark themes using OKLCH color space. Defines layout for app container, note counter, transcription area, and action buttons.",
  "frontend/src/lib/notesStorage.ts": "LocalStorage-based CRUD operations for notes including create, list, update, delete, and deleteAll functions. Stores notes as JSON array with error handling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/src/types/notes.ts": "TypeScript interface defining the Note type with id, content, and created_at fields.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file that defines custom theme extensions including OKLCH color system with CSS variables, container settings, border radius utilities, custom animations for accordions, and includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state file for a French voice notes app tracking implementation of three blue rectangular buttons (record, view, delete) with icons and text labels, containing feature tracking, architectural notes, and requirement IDs."
}